Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus supports the automatic provisioning of unconfigured services in development and test mode. We refer to this capability as Dev Services. From a developer's perspective this means that if you include an extension and don't configure it then Quarkus will automatically start the relevant service (usually using https://www.testcontainers.org/[Testcontainers] behind the scenes) and wire up your application to use this service.
ja_jp: Quarkusは、開発およびテストモードでの未設定サービスの自動プロビジョニングをサポートしています。この機能をDev Servicesと呼んでいます。開発者の視点から見ると、エクステンションを含めてもそれを設定しなければ、Quarkusは自動的に関連するサービスを開始し（通常、舞台裏で link:https://www.testcontainers.org/[Testcontainers]を使用します）、このサービスを使用するためにアプリケーションを設定することを意味します。

source: Quarkus supports the automatic provisioning of unconfigured services in development and test mode. We refer to this capability as Dev Services. If you include an extension and don't configure it then Quarkus will automatically start the relevant service (usually using https://www.testcontainers.org/[Testcontainers] behind the scenes) and wire up your application to use this service.
ja_jp: Quarkusは、開発モードとテストモードにおける未構成サービスの自動プロビジョニングをサポートしています。この機能をDev Servicesと呼びます。 エクステンションを追加する一方でそれを設定しない場合、Quarkusは自動的に関連するサービスを開始し（通常は裏で link:https://www.testcontainers.org/[Testcontainers] を使用）、このサービスを使用するようにアプリケーションを配線します。

source: Quarkus supports the link:https://github.com/k8s-service-bindings/spec[Service Binding Specification for Kubernetes] to bind services to applications.
ja_jp: Quarkus は、サービスをアプリケーションにバインドするために、link:https://github.com/k8s-service-bindings/spec[Service Binding Specification for Kubernetes] をサポートします。

source: Quarkus supports the link:https://github.com/servicebinding/spec[Service Binding Specification for Kubernetes] to bind services to applications.
ja_jp: Quarkus は、サービスをアプリケーションにバインドするために、link:https://github.com/servicebinding/spec[Service Binding Specification for Kubernetes] をサポートします。

source: Quarkus supports the use of mock objects using two different approaches. You can either use CDI alternatives to mock out a bean for all test classes, or use `QuarkusMock` to mock out beans on a per test basis.
ja_jp: Quarkusでは、2つの異なるアプローチを使用したモックオブジェクトの使用をサポートしています。CDIの代替品を使用してすべてのテストクラスのBeanをモックアウトするか、 `QuarkusMock` を使用してテストごとにBeanをモックアウトすることができます。

source: Quarkus supports the use of mock objects using two different approaches. You can either use CDI alternatives to mock out a bean for all test classes, or use `QuarkusMock` to mock out beans on a per test basis. Check the xref:getting-started-testing.adoc[Getting started with testing guide] for more information.
ja_jp: Quarkusでは、2つの異なるアプローチによるモックオブジェクトの使用がサポートされています。CDI 代替を使用してすべてのテストクラスの Bean をモックアウトするか、 `QuarkusMock` を使用してテストごとに Bean をモックアウトします。詳細については、『 xref:getting-started-testing.adoc[Getting started with testing』ガイド] を参照してください。

source: Quarkus supports the use of property expressions in the `application.properties` file so to externalize the configuration of the tasks you should store the properties in the `application.properties` file and use the `fixedRateString`, `initialDelayString` params respectively.
ja_jp: Quarkusは、 `application.properties` ファイルでのプロパティ式の使用をサポートしているため、タスクの設定を外部化するには、プロパティを `application.properties` ファイルに保存し、それぞれ `fixedRateString` 、 `initialDelayString` パラメータを使用する必要があります。

source: Quarkus supports this by allowing you to inject CDI beans into your tests via the `@Inject` annotation (in fact, tests in Quarkus are full CDI beans, so you can use all CDI functionality). Let's create a simple test that tests the greeting service directly without using HTTP:
ja_jp: Quarkusでは、 `@Inject` アノテーションを介してテストにCDI Beanを注入できるようにすることで、これをサポートしています(実際、Quarkusのテストは完全なCDI Beanなので、すべてのCDI機能を使用することができます)。HTTPを使用せずにグリーティングサービスを直接テストするシンプルなテストを作成してみましょう。

source: Quarkus supports various paths to store your OpenAPI document under. We recommend you place it under `META-INF/openapi.yml`. Alternative paths are:
ja_jp: Quarkusは、OpenAPIドキュメントを保存するためのさまざまなパスをサポートしています。 `META-INF/openapi.yml` 以下に配置することをお勧めします。代替パスは以下の通りです。

source: Quarkus supports what is known as intercepted self-invocation or just self-interception - a scenario where CDI bean invokes its own intercepted method from within another method while triggering any associated interceptors. This is a non-standard feature as CDI specification doesn't define whether self-interception should work or not.
ja_jp: Quarkus は、インターセプトされた自己呼び出し (または単に自己インターセプションと呼ぶ) をサポートしています。これは、CDI Bean が、関連付けられているインターセプターをトリガーしながら、別のメソッド内から独自のインターセプトされたメソッドを呼び出すシナリオです。 CDI 仕様では自己インターセプトが機能するかどうかが定義されていないため、これは非標準の機能です。

source: Quarkus supports xref:config-reference.adoc#profiles[configuration profiles] in order to provide a specific configuration according to the target environment.
ja_jp: Quarkusは、対象となる環境に応じて特定の設定を提供するために、 link:config-reference.html#profiles[設定プロファイル]をサポートしています。

source: Quarkus tailors your application for GraalVM and HotSpot. Amazingly fast boot time, incredibly low RSS memory (not just heap size!) offering near instant scale up and high density memory utilization in container orchestration platforms like Kubernetes. We use a technique we call compile time boot.
ja_jp: Quarkusはお客様のアプリケーションをGraalVMとHotSpot用に最適化します。驚くほど速い起動時間、信じられないほど低いRSSメモリ（ヒープサイズだけではありません！）は、Kubernetesのようなコンテナオーケストレーションプラットフォームにおいて、ほぼ瞬時にスケールアップし、高密度のメモリ利用を提供します。私たちはコンパイルタイムブートと呼ばれる技術を使用しています。

source: Quarkus tailors your application for GraalVM and HotSpot. Amazingly fast boot time, incredibly low RSS memory (not just heap size!) offering near instant scale up and high density memory utilization in container orchestration platforms like Kubernetes. We use a technique we call compile time boot. <a href="/container-first">Learn more.</a>
ja_jp: Quarkusは、お客様のアプリケーションをGraalVMとHotSpot向けに調整します。驚くほど高速な起動時間、驚くほど低いRSSメモリ（ヒープサイズだけではありません！）、Kubernetesのようなコンテナオーケストレーションプラットフォームでのほぼ即時のスケールアップと高密度のメモリ利用を提供します。<a href="/container-first">詳細はこちら</a>

source: Quarkus takes care of registering the `CodecProvider` for you as a CDI bean of `@Singleton` scope.
ja_jp: Quarkusは、 `CodecProvider` を `@Singleton` スコープのCDIビーンとして登録する作業を行います。

source: Quarkus task
ja_jp: Quarkus タスク

source: Quarkus together with AWS Lambda SnapStart functions enables further runtime optimizations close to the native performance and much faster than the regular Java ones. For some functions, SnapStart is faster than a cold start of a native executable in AWS Lambda. For others, memory usage is better with the native image.
ja_jp: QuarkusとAWS LambdaのSnapStart関数を組み合わせると、ネイティブのパフォーマンスに近い、通常のJavaよりもはるかに高速な実行時最適化がさらに可能になります。一部の機能では、SnapStartはAWS Lambdaでネイティブ実行可能ファイルをコールドスタートするよりも高速です。その他の機能では、メモリ使用量はネイティブイメージの方が優れています。

source: Quarkus users are encouraged to always prefer the `@Observes StartupEvent` to `@Initialized(ApplicationScoped.class)` as explained in the xref:lifecycle.adoc[Application Initialization and Termination] guide.
ja_jp: Quarkus ユーザーは、 xref:lifecycle.adoc[アプリケーションの初期化と終了] のガイドで説明されているように、常に `@Initialized(ApplicationScoped.class)` よりも `@Observes StartupEvent` を選択することが推奨されます。

source: Quarkus users are free to copy the files from the folder reported in the build, store them under source control and evolve as needed. Ideally these files should be stored under the `src/main/resources/META-INF/native-image/<group-id>/<artifact-id>`` folder, in which case the native image process will automatically pick them up.
ja_jp: Quarkus ユーザーはビルドで報告されたフォルダーからファイルを自由にコピーできます。 ソース管理下に保存し、必要に応じて進化させます。 理想的には、これらのファイルは `src/main/resources/META-INF/native-image/<group-id>/<artifact-id>``フォルダーに配置してください。そうすると、 ネイティブイメージプロセスによって自動的に取得されます。

source: Quarkus users can now run JVM mode integration tests on Quarkus Maven applications transparently with the native image tracing agent. To do this make sure a container runtime is available, because JVM mode integration tests will run using the JVM within the default Mandrel builder container image. This image contains the agent libraries required to produce native image configuration, hence avoiding the need for a local Mandrel or GraalVM installation.
ja_jp: Quarkus ユーザーは、ネイティブイメージトレーシングエージェントを使用して、Quarkus Maven アプリケーションで JVM モードの結合テストを透過的に実行できるようになりました。 これを行うには、コンテナーランタイムが利用可能であることを確認してください。 JVM モードの結合テストは、デフォルトの Mandrel ビルダーコンテナーイメージ内の JVM を使用して実行されるためです。 このイメージには、ネイティブイメージ設定の生成に必要なエージェントライブラリーが含まれています。 したがって、ローカルの Mandrel または GraalVM のインストールが不要になります。

source: Quarkus users that want to integrate new libraries/components into native image process (e.g. link:https://github.com/hierynomus/smbj[smbj]), or want to use JDK APIs that require extensive native image configuration to work (e.g. graphical user interfaces), face a considerable challenge coming up with the native image configuration to make their use cases work. These users can tweak their applications to run in JVM mode with the native image agent in order to auto-generate native image configuration that will help them get a head start getting applications to work as native executables.
ja_jp: 新しいライブラリー/コンポーネントをネイティブイメージ処理に統合する Quarkus ユーザー (例: リンク:https://github.com/hierynomus/smbj[smbj])、 または、広範なネイティブイメージ設定を機能させるために必要な JDK API (グラフィカルユーザーインターフェイスなど) を使用する場合、 ユースケースを機能させるネイティブイメージ設定を生み出すのはかなり困難です。 このようなユーザーは、ネイティブイメージエージェントを使用して JVM モードで実行するようにアプリケーションを調整することで、 ネイティブイメージ設定を自動生成し、アプリケーションをネイティブ実行可能ファイルとして動作させるための準備がしやすくなります。

source: Quarkus uses JBoss Logging as its logging engine, and xref:logging.adoc[supports several logging APIs]. (This is normal Java logging, not OpenTelemetry logging.)
ja_jp: Quarkus は、ロギングエンジンとして JBoss Logging を使用し、xref:logging.adoc[複数のログ記録 API をサポートしています]。(これは通常の Java ロギングであり、OpenTelemetry ログ記録ではありません。)

source: Quarkus uses OpenTelemetry Tracing to provide tracing capabilities to the application. The xref:opentelemetry.adoc[`quarkus-opentelemetry`] and the xref:telemetry-micrometer-to-opentelemetry.adoc[`quarkus-micrometer-opentelemetry`] extensions are the recommended way to use for tracing.
ja_jp: Quarkus は OpenTelemetry Tracing を使用してアプリケーションにトレース機能を提供します。トレースには xref:opentelemetry.adoc[`quarkus-opentelemetry`] および xref:telemetry-micrometer-to-opentelemetry.adoc[`quarkus-micrometer-opentelemetry`] エクステンションの使用が推奨されます。

source: Quarkus uses Protobuf for data serialization in Infinispan by default. Infinispan recommends using Protobuf as the preferred way to structure data. Therefore, when working with Plain Old Java Objects (POJOs), users need to supply the schema for marshalling in Infinispan.
ja_jp: Quarkus はデフォルトで Infinispan におけるデータのシリアル化に Protobuf を使用します。Infinispan は データを構造化する方法 として Protobuf を推奨しています。したがって、Plain Old Java Objects (POJO) を使用する場合、ユーザーは Infinispan での マーシャリング用のスキーマを提供する必要があります。

source: Quarkus uses Vert.x heavily. The `quarkus-vertx-core` extension manages the Vert.x instance used by Quarkus. You can use that instance directly and avoid creating the Vert.x instance. If you need to configure the instance, you can configure it from https://quarkus.io/guides/all-config#quarkus-vertx-core_quarkus-vertx-core-eclipse-vert.x-core[the `application.properties`]. It also enables native packaging (as that extension contains the directive to compile Vert.x applications to native).
ja_jp: QuarkusはVert.xを多用しています。 `quarkus-vertx-core` エクステンションは、Quarkusが使用するVert.xインスタンスを管理します。そのインスタンスを直接使用することができ、Vert.xインスタンスを作成する必要はありません。インスタンスを設定する必要がある場合は、 link:https://quarkus.io/guides/all-config#quarkus-vertx-core_quarkus-vertx-core-eclipse-vert.x-core[`application.properties`] から設定することができます。また、ネイティブパッケージングも可能になります(このエクステンションには Vert.x アプリケーションをネイティブにコンパイルするためのディレクティブが含まれているため)。

source: Quarkus uses a feature-rich application startup script, which allows us to add JVM system properties at runtime by simply setting an environment variable:
ja_jp: Quarkusでは、機能豊富なアプリケーション起動スクリプトを使用しており、環境変数を設定するだけで、実行時にJVMシステムプロパティを追加することができます。

source: Quarkus uses a pattern-based logging formatter that generates human-readable text logs by default, but you can also configure the format for each log handler by using a dedicated property.
ja_jp: Quarkusは、デフォルトで人間が読めるテキストログを生成するパターンベースのログフォーマッタを使用しますが、専用のプロパティを使用して、各ログハンドラのフォーマットを設定することもできます。

source: Quarkus uses https://microprofile.io/project/eclipse/microprofile-config[MicroProfile Config] annotations to inject the configuration properties in the application.
ja_jp: Quarkus では、 link:https://microprofile.io/project/eclipse/microprofile-config[MicroProfile Config] アノテーションを使用して、アプリケーションに設定プロパティーを注入しています。

source: Quarkus uses https://microprofile.io/specifications/config/[MicroProfile Config] annotations to inject the configuration properties in the application.
ja_jp: Quarkus は、 https://microprofile.io/specifications/config/[MicroProfile Config] アノテーションを使用して、アプリケーションに設定プロパティーを注入します。

source: Quarkus uses its own signal handler, to use GraalVM's default signal handler instead you will need to: 1. Add `-H:+DumpThreadStacksOnSignal` to `quarkus.native.additional-build-args` and rebuild the application. 2. Set the environment variable `DISABLE_SIGNAL_HANDLERS` before running the app.
ja_jp: Quarkus は独自のシグナルハンドラーを使用しますが、代わりに GraalVM のデフォルトのシグナルハンドラーを使用するには、次の操作を行う必要があります。 1. `quarkus.native.additional-build-args` に `-H:+DumpThreadStacksOnSignal` を追加し、アプリケーションを再構築します。 2. アプリケーションを実行する前に、環境変数 `DISABLE_SIGNAL_HANDLERS` を設定します。

source: Quarkus uses link:https://agroal.github.io/[Agroal] and link:https://vertx.io/[Vert.x] to provide high-performance, scalable data source connection pooling for JDBC and reactive drivers. The `jdbc-\*` and `reactive-*` extensions provide build time optimizations and integrate configured data sources with Quarkus features like security, health checks, and metrics.
ja_jp: Quarkusは、 link:https://agroal.github.io/[Agroal] と link:https://vertx.io/[Vert.x] を使用して、JDBCとリアクティブドライバ用の高性能でスケーラブルなデータソースコネクションプーリングを提供します。 `jdbc-*` 、 `reactive-*` のエクステンションは、ビルド時間の最適化を提供し、設定されたデータソースとQuarkusのセキュリティ、ヘルスチェック、メトリクスなどの機能を統合します。

source: Quarkus uses link:https://agroal.github.io/[Agroal] and link:https://vertx.io/[Vert.x] to provide high-performance, scalable data source connection pooling for JDBC and reactive drivers. The `quarkus-jdbc-\*` and `quarkus-reactive-*-client` extensions provide build time optimizations and integrate configured data sources with Quarkus features like security, health checks, and metrics.
ja_jp: Quarkusは、 link:https://agroal.github.io/[Agroal] と link:https://vertx.io/[Vert.x] を使用して、JDBCとリアクティブドライバ用の高性能でスケーラブルなデータソース接続プーリングを提供します。 `quarkus-jdbc-*` 、 `quarkus-reactive-*-client` のエクステンションは、ビルド時最適化を提供し、設定されたデータソースを、セキュリティ、ヘルスチェック、メトリクスなどのQuarkusの機能と統合します。

source: Quarkus uses link:https://agroal.github.io/[Agroal] and link:https://vertx.io/[Vert.x] to provide high-performance, scalable datasource connection pooling for JDBC and reactive drivers. The `quarkus-jdbc-\*` and `quarkus-reactive-*-client` extensions provide build time optimizations and integrate configured datasources with Quarkus features like security, health checks, and metrics.
ja_jp: Quarkusは、link:https://agroal.github.io/[Agroal] と link:https://vertx.io/[Vert.x] を使用して、JDBC とリアクティブドライバー用の高性能でスケーラブルなデータソース接続プーリングを提供します。 `quarkus-jdbc-\*` および `quarkus-reactive-*-client` のエクステンションは、ビルド時最適化を提供し、設定されたデータソースを、セキュリティー、ヘルスチェック、メトリクスなどの Quarkus の機能と統合します。

source: Quarkus uses link:https://agroal.github.io/[Agroal] and link:https://vertx.io/[Vert.x] to provide high-performance, scalable datasource connection pooling for JDBC and reactive drivers. The `quarkus-jdbc-\*` and `quarkus-reactive-*-client` extensions provide build-time optimizations and integrate configured datasources with Quarkus features such as security, health checks, and metrics.
ja_jp: Quarkus は link:https://agroal.github.io/[Agroal] と link:https://vertx.io/[Vert.x] を使用して、JDBC とリアクティブドライバー用の高性能でスケーラブルなデータソース接続プーリングを提供します。 `quarkus-jdbc-\*` および `quarkus-reactive-*-client` エクステンションは、ビルド時最適化を提供し、設定されたデータソースをセキュリティー、ヘルスチェック、メトリクスなどの Quarkus 機能と統合します。

source: Quarkus uses smart defaults when determining the media type of JAX-RS methods in order to simplify common use cases. The difference between `quarkus-resteasy-reactive` and `quarkus-resteasy` is the use of `text/plain` as the default media type instead of `text/html` when the method returns a `String`.
ja_jp: Quarkusでは、一般的なユースケースをシンプルにするために、JAX-RSメソッドのメディアタイプを決定する際にスマートデフォルトを使用しています。 `quarkus-resteasy-reactive` と `quarkus-resteasy` の違いは、メソッドが `String` を返す場合、 `text/html` の代わりに `text/plain` をデフォルトのメディアタイプとして使用することです。

source: Quarkus uses smart defaults when determining the media type of Jakarta REST methods in order to simplify common use cases. The difference between `quarkus-rest` and `quarkus-resteasy` is the use of `text/plain` as the default media type instead of `text/html` when the method returns a `String`.
ja_jp: Quarkusでは、一般的なユースケースで簡単に使えるようにするために、Jakarta RESTメソッドのメディアタイプを決定する際にスマートデフォルトを使用しています。 `quarkus-rest` と `quarkus-resteasy` の違いは、メソッドが `String` を返すときに、 `text/html` の代わりに `text/plain` をデフォルトのメディアタイプとして使用することです。

source: Quarkus uses smart defaults when determining the media type of Jakarta REST methods in order to simplify common use cases. The difference between `quarkus-resteasy-reactive` and `quarkus-resteasy` is the use of `text/plain` as the default media type instead of `text/html` when the method returns a `String`.
ja_jp: Quarkusでは、一般的なユースケースで簡単に使えるようにするために、Jakarta RESTメソッドのメディアタイプを決定する際にスマートデフォルトを使用しています。 `quarkus-resteasy-reactive` と `quarkus-resteasy` の違いは、メソッドが `String` を返すときに、 `text/html` の代わりに `text/plain` をデフォルトのメディアタイプとして使用することです。

source: Quarkus uses the *JBoss Log Manager* logging backend to publish application and framework logs either in the console or files. These logs can also be forwarded to a centralized logging system, either by using the legacy xref:centralized-log-management.adoc[`quarkus-logging-gelf`] extension or the recommended xref:opentelemetry.adoc[`quarkus-opentelemetry`] or xref:telemetry-micrometer-to-opentelemetry.adoc[`quarkus-micrometer-opentelemetry`] extensions.
ja_jp: Quarkus は、*JBoss Log Manager* ロギングバックエンドを使用して、アプリケーションおよびフレームワークのログをコンソールまたはファイルに公開します。これらのログは、従来の xref:centralized-log-management.adoc[`quarkus-logging-gelf`] エクステンション、または推奨される xref:opentelemetry.adoc[`quarkus-opentelemetry`] あるいは xref:telemetry-micrometer-to-opentelemetry.adoc[`quarkus-micrometer-opentelemetry`] エクステンションを使用して、集中ロギングシステムに転送することもできます。

source: Quarkus uses the JBoss Log Manager logging backend for publishing application and framework logs. Quarkus supports the JBoss Logging API and multiple other logging APIs, seamlessly integrated with JBoss Log Manager.
ja_jp: Quarkus は、アプリケーションとフレームワークのログを発行するために JBoss Log Manager ロギングバックエンドを使用します。 Quarkus は JBoss Logging API と他の複数のロギング API をサポートしており、これらは JBoss Log Manager とシームレスに統合されています。

source: Quarkus uses the JBoss Log Manager logging backend for publishing application and framework logs. Quarkus supports the JBoss Logging API and multiple other logging APIs, seamlessly integrated with JBoss Log Manager. You can use any of the <<logging-apis,following APIs>>:
ja_jp: Quarkusは、JBoss Log Managerロギングバックエンドを使用して、アプリケーションとフレームワークのログを発行します。 Quarkusは、JBoss Logging APIと他の複数のロギングAPIをサポートしており、JBoss Log Managerとシームレスに統合されています。 xref:logging-apis[以下のAPI] のいずれも使用できます：

source: Quarkus uses the JBoss Log Manager logging backend for publishing application and framework logs. Quarkus supports the JBoss Logging API and multiple other logging APIs, seamlessly integrated with JBoss Log Manager. You can use any of the xref:logging-apis[following APIs]:
ja_jp: Quarkusは、アプリケーションとフレームワークのログを発行するために、JBoss Log Managerロギングバックエンドを使用します。 Quarkusは、JBoss Logging APIと他の複数のロギングAPIをサポートしており、JBoss Log Managerとシームレスに統合されています。 xref:logging-apis[以下のAPI] のいずれかを使用できます：

source: Quarkus uses the Java Flight Recorder (JFR) to provide profiling capabilities to the application. The xref:jfr.adoc[`quarkus-jfr`] extension is the recommended way to generate the events necessary to profile the application.
ja_jp: Quarkus は、Java Flight Recorder (JFR) を使用して、アプリケーションにプロファイリング機能を提供します。アプリケーションのプロファイリングに必要なイベントを生成するには、xref:jfr.adoc[`quarkus-jfr`] エクステンションの使用が推奨されます。

source: Quarkus uses the ‘quarkus-amazon-lambda’ extension to build and deploy functions to AWS Lambda. The extension allows developers to use the Quarkus development model like live coding, continuous testing, etc., and the ability to use CDI Injections and additional quarkus extensions. Developers can deploy functions to AWS Lambda using native or Java mode. With today's http://aws.amazon.com/blogs/aws/new-accelerate-your-lambda-functions-with-lambda-snapstart[announcement], the SnapStart feature is now an additional option to build and deploy functions written with Quarkus to AWS Lambda.
ja_jp: Quarkusでは、 'quarkus-amazon-lambda' エクステンションを使用して、AWS Lambdaへの関数のビルドとデプロイを行っています。このエクステンションにより、開発者はライブコーディング、継続的テストなどのQuarkus開発モデルや、CDI Injectionsや追加のQuarkusエクステンションを使用することができるようになります。開発者は、ネイティブモードまたはJavaモードを使用して、AWS Lambdaに関数をデプロイすることができます。本日の link:http://aws.amazon.com/blogs/aws/new-accelerate-your-lambda-functions-with-lambda-snapstart[発表]により 、Quarkusで書かれた関数をAWS Lambdaにビルドしてデプロイするためのオプションとして、SnapStart機能が追加されました。

source: Quarkus utilizes <a href="https://opentelemetry.io/" target="_blank">OpenTelemetry</a> which is a vendor-agnostic API to help developers easily instrument tracing into their codebase. Distributed tracing helps pinpoint where failures occur and what causes poor performance.
ja_jp: Quarkusは、ベンダーに依存しないAPIである <a href="https://opentelemetry.io/" target="_blank">OpenTelemetry</a> を利用し、開発者がコードベースにトレースを簡単に組み込むのを支援します。分散トレースは、障害の発生箇所とパフォーマンス低下の原因を特定するのに役立ちます。

source: Quarkus utilizes the <a href="https://micrometer.io/" target="_blank">Micrometer</a> metrics library for runtime and application metrics. It provides a simple facade for the most popular monitoring systems to instrument your JVM-based application code without vendor lock-in. Application-specific and built-in metrics can be exposed using Micrometer.
ja_jp: Quarkusは、ランタイムおよびアプリケーションメトリクスに <a href="https://micrometer.io/" target="_blank">Micrometer</a> メトリクスライブラリを利用しています。これは、最も人気のある監視システムに対するシンプルなファサードを提供し、ベンダーロックインなしでJVMベースのアプリケーションコードを計装できます。アプリケーション固有のメトリクスや組み込みメトリクスは、Micrometerを使用して公開できます。

source: Quarkus validates at build time that each template that corresponds to the `Templates#items()` contains a fragment with identifier `item`. Moreover, the parameters of the fragment method are validated too. In general, all type-safe expressions that are found in the fragment and that reference some data from the original/outer template require a specific parameter to be present.
ja_jp: Quarkusでは、ビルド時に、 `Templates#items()` に対応する各テンプレートに、識別子 `item` を持つフラグメントが含まれているかどうかが検証されます。さらに、フラグメントメソッドのパラメーターも検証されます。一般に、フラグメントに含まれ、オリジナル／アウターテンプレートのデータを参照するすべてのタイプセーフ 式には、特定のパラメータが必要です。

source: Quarkus version
ja_jp: Quarkusバージョン

source: Quarkus version resolved at build time
ja_jp: Quarkus のバージョンはビルド時に解決されます

source: Quarkus version the extension was built with
ja_jp: エクステンションがビルドされた Quarkus のバージョン

source: Quarkus was already providing a way to handle HTTP requests from the IO thread. Reactive Routes provides a declarative model to implement HTTP API. Each route can be called on the IO thread (default) or on a worker thread (using the `@Blocking` annotation). Reactive Routes provide very good throughput and performance as highlighted in https://quarkus.io/blog/io-thread-benchmark/[this] article. How does reactive routes compare to RESTEasy Reactive?
ja_jp: Quarkusはすでに IO スレッドから HTTP リクエストを処理する方法を提供していました。Reactive Routes (リアクティブルート) は、HTTP API を実装するための宣言モデルを提供します。各ルートは、IO スレッド (デフォルト) またはワーカースレッド (`@Blocking` アノテーションを使用) で呼び出すことができます。link:https://quarkus.io/blog/io-thread-benchmark/[この]記事で強調されているように、Reactive Routes は非常に優れたスループットとパフォーマンスを提供します。リアクティブルートは RESTEasy Reactive と比較してどうでしょうか?
